Revit 2024 API
AreaReinforcementLayerType Enumeration
 Describes the layers of an Area Reinforcement
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Since: 2022
Syntax
C#
public enum AreaReinforcementLayerType
Visual Basic
Public Enumeration AreaReinforcementLayerType
Visual C++
public enum class AreaReinforcementLayerType
Members
Member name | Description
TopOrFrontMajor |  Reinforcement layer is on the top face of a floor host, or on the front face of a wall host in the major direction.
TopOrFrontMinor |  Reinforcement layer is on the top face of a floor host, or on the front face of a wall host in the minor direction.
BottomOrBackMajor |  Reinforcement layer is on the bottom face of a floor host, or on the back face of a wall host in the major direction.
BottomOrBackMinor |  Reinforcement layer is on the bottom face of a floor host, or on the back face of a wall host in the minor direction.
See Also
Autodesk.Revit.DB.Structure Namespace